Repository: daka-kolp/my_dictionary
Catalog: lib/src/device/l10n/*_dictionary_*.arb
Languages: ru

# hint
source: A hint
ru: Подсказка

source: Ok
ru: Ок

# showTranslation
source: Show a translation
ru: Показать перевод

source: Add
ru: Добавить

source: Listen
ru: Слушать

source: Edit
ru: Править

# enterWord
source: Enter a word
ru: Введите слово

# addTranslation
source: Add translations
ru: Добавьте перевод

# addHint
source: Add a hint
ru: Добавьте подсказку

# editWord
source: Edit the word
ru: Отредактируйте слово

# editTranslation
source: Edit the translations
ru: Отредактируйте перевод

# editHint
source: Edit the hint
ru: Отредактируйте подсказку

# newWord
source: A new word
ru: Новое слово

# writeTranslation
source: Write a translation
ru: Напишите предполагаемый перевод

# writeAssociationOrHint
source: Write an association or hint
ru: Напишите ассоциацию или подсказку

source: Remove
ru: Удалить

source: Cancel
ru: Отмена

# removeWordQuestion
source: Are you sure you want to delete this word?
ru: Вы уверены что хотите удалить это слово?

# wordAlreadyExistException
source: This word already exists in the dictionary
ru: Это слово уже существует в словаре

# wordNotExistException
source: This word does not exist in the dictionary
ru: Это слово не существует в словаре

# userDictionaries
source: User's dictionaries
ru: Словари пользователя

# enterWithGoogle
source: Login with Google
ru: Войти с помощью Google

source: or
ru: или

# enterWithApple
source: Login with Apple
ru: Войти с помощью Apple

# askChangeUser
source: Do you want to change user?
ru: Вы хотите сменить пользователя?

# listEmptyInfo
source: The list is empty. Use "+" to add a new item
ru: Список пуст. Используйте «+», чтобы добавить новый элемент

source: Change user
ru: Сменить пользователя

# logOutException
source: The problems related to user change. Try restarting the app
ru: Проблемы связанные со сменой пользователя. Попробуйте перезагрузить приложение

# newDictionary
source: A new dictionary
ru: Новый словарь

# addOriginalLanguage
source: Select the language of the dictionary
ru: Выберите язык словаря

# enterDictionaryName
source: Enter the name of the dictionary (generated automatically, the field can be edited)
ru: Введите название словаря (генерируется автоматически, поле может редактироваться)

# wrongCredentials
source: Invalid credentials
ru: Неверные учетные данные

# choseTargetLanguage
source: Select target language
ru: Выберите целевой язык

# dictionaryAlreadyExistException
source: A dictionary with the same name already exists
ru: Словарь с таким названием уже существует

# dictionaryNotExistException
source: This word does not exist in the dictionary
ru: Это слово не существует в словаре

# editDictionaryName
source: Edit the name of the dictionary
ru: Отредактируйте название словаря

# removeDictionaryQuestion
source: Are you sure you want to delete this dictionary?
ru: Вы уверены что хотите удалить этот словарь?
